In [121]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [122]:
dt=pd.read_excel("titanic3.xls")

In [123]:
dt.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [124]:
dt.isna().sum(), dt.shape

(pclass          0
 survived        0
 name            0
 sex             0
 age           263
 sibsp           0
 parch           0
 ticket          0
 fare            1
 cabin        1014
 embarked        2
 boat          823
 body         1188
 home.dest     564
 dtype: int64, (1309, 14))

In [125]:
dt.body.isna().sum()

1188

In [126]:
dt.drop(["cabin","body","home.dest","name","ticket"],axis=1,inplace=True)

In [127]:
dt.isna().sum()

pclass        0
survived      0
sex           0
age         263
sibsp         0
parch         0
fare          1
embarked      2
boat        823
dtype: int64

In [128]:
dt.head()

   pclass  survived     sex      age  sibsp  parch      fare embarked boat
0       1         1  female  29.0000      0      0  211.3375        S    2
1       1         1    male   0.9167      1      2  151.5500        S   11
2       1         0  female   2.0000      1      2  151.5500        S  NaN
3       1         0    male  30.0000      1      2  151.5500        S  NaN
4       1         0  female  25.0000      1      2  151.5500        S  NaN

In [129]:
# dt.sex[dt.sex=="male"]=1
# dt.sex[dt.sex=="female"]=0


a={"male":1,"female":0}
dt.sex=dt.sex.map(a)

In [130]:
dt

      pclass  survived  sex      age  sibsp  parch      fare embarked boat
0          1         1    0  29.0000      0      0  211.3375        S    2
1          1         1    1   0.9167      1      2  151.5500        S   11
2          1         0    0   2.0000      1      2  151.5500        S  NaN
3          1         0    1  30.0000      1      2  151.5500        S  NaN
4          1         0    0  25.0000      1      2  151.5500        S  NaN
...      ...       ...  ...      ...    ...    ...       ...      ...  ...
1304       3         0    0  14.5000      1      0   14.4542        C  NaN
1305       3         0    0      NaN      1      0   14.4542        C  NaN
1306       3         0    1  26.5000      0      0    7.2250        C  NaN
1307       3         0    1  27.0000      0      0    7.2250        C  NaN
1308       3         0    1  29.0000      0      0    7.8750        S  NaN

[1309 rows x 9 columns]

In [131]:
dt.head()

   pclass  survived  sex      age  sibsp  parch      fare embarked boat
0       1         1    0  29.0000      0      0  211.3375        S    2
1       1         1    1   0.9167      1      2  151.5500        S   11
2       1         0    0   2.0000      1      2  151.5500        S  NaN
3       1         0    1  30.0000      1      2  151.5500        S  NaN
4       1         0    0  25.0000      1      2  151.5500        S  NaN

In [132]:
dt.isna().sum()

pclass        0
survived      0
sex           0
age         263
sibsp         0
parch         0
fare          1
embarked      2
boat        823
dtype: int64

In [133]:
dt.age.value_counts()

24.0000    47
22.0000    43
21.0000    41
30.0000    40
18.0000    39
           ..
26.5000     1
67.0000     1
70.5000     1
76.0000     1
0.6667      1
Name: age, Length: 98, dtype: int64

In [134]:
dt.age=dt.age.fillna(dt.age.mode()[0])

In [135]:
dt.age.mode()[0]

24.0

In [136]:
dt.isna().sum()

pclass        0
survived      0
sex           0
age           0
sibsp         0
parch         0
fare          1
embarked      2
boat        823
dtype: int64

In [137]:
dt.drop("boat",axis=1,inplace=True)

In [138]:
dt.head()

   pclass  survived  sex      age  sibsp  parch      fare embarked
0       1         1    0  29.0000      0      0  211.3375        S
1       1         1    1   0.9167      1      2  151.5500        S
2       1         0    0   2.0000      1      2  151.5500        S
3       1         0    1  30.0000      1      2  151.5500        S
4       1         0    0  25.0000      1      2  151.5500        S

In [139]:
dt.isna().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        1
embarked    2
dtype: int64

In [140]:
dt.fare=dt.fare.fillna(dt.fare.mean())

In [141]:
dt.isna().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    2
dtype: int64

In [142]:
dt.embarked.value_counts()
dt.embarked=dt.embarked.fillna(dt.embarked.mode()[0])

In [143]:
dt.isna().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [144]:
dt.head()

   pclass  survived  sex      age  sibsp  parch      fare embarked
0       1         1    0  29.0000      0      0  211.3375        S
1       1         1    1   0.9167      1      2  151.5500        S
2       1         0    0   2.0000      1      2  151.5500        S
3       1         0    1  30.0000      1      2  151.5500        S
4       1         0    0  25.0000      1      2  151.5500        S

In [145]:
embarked_=pd.get_dummies(dt["embarked"],drop_first=True)
embarked_.head()

   Q  S
0  0  1
1  0  1
2  0  1
3  0  1
4  0  1

In [146]:
dt=pd.concat([dt,embarked_],axis=1)

In [147]:
dt.head()

   pclass  survived  sex      age  sibsp  parch      fare embarked  Q  S
0       1         1    0  29.0000      0      0  211.3375        S  0  1
1       1         1    1   0.9167      1      2  151.5500        S  0  1
2       1         0    0   2.0000      1      2  151.5500        S  0  1
3       1         0    1  30.0000      1      2  151.5500        S  0  1
4       1         0    0  25.0000      1      2  151.5500        S  0  1

In [148]:
# dt.embarked[dt.embarked=="S"]=0
# dt.embarked[dt.embarked=="C"]=1
# dt.embarked[dt.embarked=="Q"]=2
# dt.drop("embarked",axis=1,inplace=True)

In [149]:
dt.drop("embarked",axis=1,inplace=True)

In [150]:
dt.head()

   pclass  survived  sex      age  sibsp  parch      fare  Q  S
0       1         1    0  29.0000      0      0  211.3375  0  1
1       1         1    1   0.9167      1      2  151.5500  0  1
2       1         0    0   2.0000      1      2  151.5500  0  1
3       1         0    1  30.0000      1      2  151.5500  0  1
4       1         0    0  25.0000      1      2  151.5500  0  1

In [151]:
dt.corr()

,pclass,survived,sex,age,sibsp,parch,fare,Q,S
pclass,1.000000,-0.312469,0.124617,-0.397857,0.060832,0.018322,-0.558477,0.230491,0.091320
survived,-0.312469,1.000000,-0.528693,-0.029985,-0.027825,0.082660,0.244208,-0.016071,-0.150542
sex,0.124617,-0.528693,1.000000,0.045260,-0.109609,-0.213125,-0.185484,-0.088651,0.115193
age,-0.397857,-0.029985,0.045260,1.000000,-0.186248,-0.113955,0.192229,-0.069303,-0.019224
sibsp,0.060832,-0.027825,-0.109609,-0.186248,1.000000,0.373587,0.160224,-0.048678,0.073709
parch,0.018322,0.082660,-0.213125,-0.113955,0.373587,1.000000,0.221522,-0.100943,0.071881
fare,-0.558477,0.244208,-0.185484,0.192229,0.160224,0.221522,1.000000,-0.130054,-0.169894
Q,0.230491,-0.016071,-0.088651,-0.069303,-0.048678,-0.100943,-0.130054,1.000000,-0.491656
S,0.091320,-0.150542,0.115193,-0.019224,0.073709,0.071881,-0.169894,-0.491656,1.000000

In [152]:
dt.corr()['survived']

pclass     -0.312469
survived    1.000000
sex        -0.528693
age        -0.029985
sibsp      -0.027825
parch       0.082660
fare        0.244208
Q          -0.016071
S          -0.150542
Name: survived, dtype: float64

In [153]:
dt.head()

   pclass  survived  sex      age  sibsp  parch      fare  Q  S
0       1         1    0  29.0000      0      0  211.3375  0  1
1       1         1    1   0.9167      1      2  151.5500  0  1
2       1         0    0   2.0000      1      2  151.5500  0  1
3       1         0    1  30.0000      1      2  151.5500  0  1
4       1         0    0  25.0000      1      2  151.5500  0  1

In [154]:
x=dt.drop("survived",axis=1)
y=dt.survived

In [155]:

from sklearn.model_selection import train_test_split
x_tr,x_ts,y_tr,y_ts=train_test_split(x,y,test_size=0.2,random_state=0)

In [156]:
from sklearn.preprocessing import StandardScaler
std=StandardScaler()
x_tr_sc=std.fit_transform(x_tr)
x_ts_sc=std.transform(x_ts)

In [157]:
x_tr

      pclass  sex      age  sibsp  parch      fare  Q  S
1118       3    1  25.0000      0      0    7.9250  0  1
44         1    0  41.0000      0      0  134.5000  0  0
1072       3    1  24.0000      0      0    7.7333  1  0
1130       3    0  18.0000      0      0    7.7750  0  1
574        2    1  29.0000      1      0   21.0000  0  1
...      ...  ...      ...    ...    ...       ... .. ..
763        3    0   0.1667      1      2   20.5750  0  1
835        3    1  24.0000      0      0    8.0500  0  1
1216       3    0  24.0000      0      0    7.7333  1  0
559        2    0  20.0000      0      0   36.7500  0  1
684        3    0  32.0000      1      1   15.5000  1  0

[1047 rows x 8 columns]

In [158]:
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC

In [159]:
model=LogisticRegression()

In [160]:
model.fit(x_tr_sc,y_tr)

c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [161]:
model.score(x_ts_sc,y_ts)

0.7938931297709924

In [162]:
from sklearn.svm import SVC

In [183]:
algo=SVC(C=1.0,kernel="rbf",gamma=0.1)
algo.fit(x_tr_sc,y_tr)
pre=algo.predict(x_ts_sc)
algo.score(x_ts_sc,y_ts)

0.8129770992366412

In [181]:
from sklearn.metrics import accuracy_score
accuracy_score(y_ts,pre)

0.8129770992366412

In [182]:
from sklearn.model_selection import cross_val_score
cross=cross_val_score(SVC(),x_tr_sc,y_tr,cv=10)

c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)
c:\users\hp\appdata\local\programs\python\python36\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [166]:
cross.mean()

0.800412087912088

In [167]:
from sklearn.metrics import confusion_matrix

In [168]:
confusion_matrix(y_ts,pre)

array([[146,  16],
       [ 33,  67]], dtype=int64)

In [194]:
from sklearn.model_selection import GridSearchCV

In [204]:
parameters={"C":[1,10,100,100],"kernel":["linear"],"gamma":[0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9]}

In [205]:
grid=GridSearchCV(algo,param_grid=parameters,scoring="accuracy",cv=10,n_jobs=-1)

In [ ]:
# grid_search=grid.fit(x_tr_sc,y_tr)

In [ ]:
grid.best_score_

In [203]:
grid.best_params_

{'C': 1, 'gamma': 0.1, 'kernel': 'rbf'}

# using pipeline

In [175]:
from sklearn.preprocessing import StandardScaler

In [176]:
from sklearn.pipeline import Pipeline

In [177]:
m=Pipeline([("std",StandardScaler()),("m",SVC())])

In [178]:
m.fit(x_tr,y_tr)

Pipeline(memory=None,
         steps=[('std',
                 StandardScaler(copy=True, with_mean=True, with_std=True)),
                ('m',
                 SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
                     decision_function_shape='ovr', degree=3,
                     gamma='auto_deprecated', kernel='rbf', max_iter=-1,
                     probability=False, random_state=None, shrinking=True,
                     tol=0.001, verbose=False))],
         verbose=False)

In [179]:
m.score(x_ts,y_ts)

0.8206106870229007

## support vector machine good prediction for titanic dataset